---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayers
source: html/67db5744-2f94-526c-da65-9ba90e5c7e5b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateSlantedWallWithSingularLayers Property

Cannot create wall - its layers would degenerate or intersect. Reduce the wall's height or slant.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateSlantedWallWithSingularLayers { get; }
```